%%%-------------------------------------------------------------------
%%% @author linyibin <>
%%% @copyright (C) 2014, linyibin
%%% @doc
%%% 物品
%%% @end
%%% Created :  3 Jan 2014 by linyibin <>
%%%-------------------------------------------------------------------
-module(item).

-include("packet_def.hrl").
-include("tplt_def.hrl").

%% API
-export([make/1, 
	 get_inst_id/1, 
	 get_temp_id/1,
	 get_type/1,
	 get_name/1,
	 is_overlay/1,
	 get_overlay_count/1,
	 get_sub_id/1,
	 get_sell_price/1,
	 get_bind_type/1]).

%%%===================================================================
%%% API
%%%===================================================================

%%--------------------------------------------------------------------
%% @doc
%% @生成物品
%% @end
%%--------------------------------------------------------------------
make(TempID) ->
    InstID = uuid:gen(),
    #item{inst_id = InstID, temp_id = TempID}.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品实例ID
%% @end
%%--------------------------------------------------------------------
get_inst_id(Item) when is_tuple(Item) ->
    Item#item.inst_id.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品模板ID
%% @end
%%--------------------------------------------------------------------
get_temp_id(Item) when is_tuple(Item) ->
    Item#item.temp_id.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品类型
%% @end
%%--------------------------------------------------------------------
get_type(TempID) when is_integer(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.type.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品名称
%% @end
%%--------------------------------------------------------------------
get_name(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.name.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品销售价格
%% @end
%%--------------------------------------------------------------------
get_sell_price(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.sell_price.

%%--------------------------------------------------------------------
%% @doc
%% @是否可叠加
%% @end
%%--------------------------------------------------------------------
is_overlay(TempID) ->
    OverlayCount = get_overlay_count(TempID),
    case OverlayCount > 0 of
	true ->
	    true;
	false ->
	    false
    end.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品堆叠数量
%% @end
%%--------------------------------------------------------------------
get_overlay_count(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.overlay_count.

%%--------------------------------------------------------------------
%% @doc
%% @获取物品关联ID
%% @end
%%--------------------------------------------------------------------
get_sub_id(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.sub_id.


%%--------------------------------------------------------------------
%% @doc
%% @获取物品绑定类型
%% @end
%%--------------------------------------------------------------------
get_bind_type(TempID) ->
    ItemTplt = tplt:get_data(item_tplt, TempID),
    ItemTplt#item_tplt.bind_type.
%%%===================================================================
%%% Internal functions
%%%===================================================================

