----------------------------------------------------------------------
-- Author:	jaron.ho
-- Date:	2014-04-10
-- Brief:	keyword shield module
----------------------------------------------------------------------
local MASK = "*"	-- 屏蔽掩码
----------------------------------------------------------------------
-- 功  能：屏蔽字符串
-- 参  数：str - 需要屏蔽的字符串
-- 返回值：第1个返回值 - 屏蔽后的字符串;第二个返回值 - 字符串是否被屏蔽标识
function KeywordShield(str)
	local dest = string_filter_shield(str, MASK)
	return dest, dest == str
end
----------------------------------------------------------------------
-- 初始化屏蔽字库
string_filter_init("word.txt")
----------------------------------------------------------------------
